{
    "name": "Consume Alcohol Tracker (iOS)",
    "position": "Creator",
    "link": "https://apps.apple.com/us/app/consume-alcohol-tracker/id1633718776",
    "video_link": "https://www.youtube.com/embed/nUBm_4K6tp0",
    "logo": "consume.png",
    "color": "rgb(245, 245, 245)",
    "technologies": "Swift, SwiftUI, XCode",
    "story": "Last summer, I embarked on a personal project to develop an iOS alcohol tracking application called Consume. This idea not only aligned with my growing interest in health technology but also served as an opportunity to learn XCode, Swift, and SwiftUI. As a health-conscious individual, I noticed that many people, even those dedicated to a healthy lifestyle, often treated alcohol consumption as an exception, losing control and agency as they drink. To address this issue, I envisioned an application that would empower users to maintain control while drinking by tracking their alcohol intake. <br/> <br/> I began by designing a user-friendly iPhone application using XCode, Swift, and SwiftUI. I quickly identified ease of use as the fundamental challenge. Intoxicated users were not inclined to log drinks on their phone, so I developed a complementary Apple Watch application to streamline the process with a simple tap on the wrist. Seamless communication between the iPhone and Apple Watch endured data remained synchronized. <br/> <br/> More recently, I incorporated an Apple Shortcut for easy drink logging and connected it to the iPhone's “Back Tap” feature, as demonstrated in this MKBHD video. This innovative approach allowed users to log a drink in the Consume app by simply double-tapping the back of their iPhone with their finger. <br/> <br/> Developing the app proved to be a rewarding experience, as it allowed me to delve into the Apple ecosystem, refine my product iteration skills with a product that offered real-world utility, and further hone my abilities in self-directed learning. In addition, using SwiftUI established a strong foundation in comprehending declarative user interfaces, which has been instrumental in enhancing my grasp of React architecture.",
    "story1": "Throughout my sophmore year of college, I became personally invested in health tech. I purchased an Apple Watch to track my exercise/calory burn. I purchased a subscription to the <a style='text-decoration: underline;' href='https://www.headspace.com/'>Headspace Meditaton App</a> in an effort to improve my mental health and self-control. I also began to track my calory consumption with <a style='text-decoration: underline;' href='https://cronometer.com/'>Cronometer</a>. I found these investments to be incredibly rewarding. <br> <br>When it came to alcohol, I found that even the most health conscious individuals considered drinking to be an exception to their health crusade. More specifically, I saw that people are completely willing to sacrifice all of their agency to alcohol. With each drink, humans have less control over whether or not they will have another. <br> <br>I have no goal of spreading absolute sobriety throughout the world. In fact, I consume alcohol. I did, however, think it would be helpful to give individuals some firepower in their fight to maintain control when drinking. <br> <br>I created a simple iPhone application where users could track their drinks, familiarizing myself with XCode, Swift, and SwiftUI in the process. I quickly realized that ease of use is the top priority. Believe it or not, intoxicated individuals are not particularly motivated to open an app on their phone to log a beer. <br> <br>I immediately developed an Apple Watch application that would transform the process into a simple tap on the wrist. I also figured that Apple Watch users would be early adopters given their commitment to health. This iPhone and Watch applications sync data.<br> <br><b>My FAVORITE ease-of-use feature:</b><br>In Beta, I created an <a style='text-decoration: underline;' href='https://support.apple.com/guide/shortcuts/welcome/ios'>Apple Shortcut</a> that allows users to easily log a drink. Next, I linked the shortcut to the iPhone's <a style='text-decoration: underline;' href='https://youtu.be/aZzT538F92Y?t=34'>Back Tap Feature (MKBHD video)</a>. The final result: you can log a drink to the Consume app by simply tapping the back of your iPhone."
}