{
    "name": "Consume Alcohol Tracker (iOS)",
    "position": "Creator",
    "link": "https://apps.apple.com/us/app/consume-alcohol-tracker/id1633718776",
    "logo": "consume.png",
    "story": "Throughout my sophmore year of college, I became personally invested in health tech. I purchased an Apple Watch to track my exercise/calory burn. I purchased a subscription to the <a style='text-decoration: underline;' href='https://www.headspace.com/'>Headspace Meditaton App</a> in an effort to improve my mental health and self-control. I also began to track my calory consumption with <a style='text-decoration: underline;' href='https://cronometer.com/'>Cronometer</a>. I found these investments to be incredibly rewarding. <br> <br>When it came to alcohol, I found that even the most health conscious individuals considered drinking to be an exception to their health crusade. More specifically, I saw that people are completely willing to sacrifice all of their agency to alcohol. With each drink, humans have less control over whether or not they will have another. <br> <br>I have no goal of spreading absolute sobriety throughout the world. In fact, I consume alcohol. I did, however, think it would be helpful to give individuals some firepower in their fight to maintain control when drinking. <br> <br>I created a simple iPhone application where users could track their drinks, familiarizing myself with XCode, Swift, and SwiftUI in the process. I quickly realized that ease of use is the top priority. Believe it or not, intoxicated individuals are not particularly motivated to open an app on their phone to log a beer. <br> <br>I immediately developed an Apple Watch application that would transform the process into a simple tap on the wrist. I also figured that Apple Watch users would be early adopters given their commitment to health. This iPhone and Watch applications sync data.<br> <br><b>My FAVORITE ease-of-use feature:</b><br>In Beta, I created an <a style='text-decoration: underline;' href='https://support.apple.com/guide/shortcuts/welcome/ios'>Apple Shortcut</a> that allows users to easily log a drink. Next, I linked the shortcut to the iPhone's <a style='text-decoration: underline;' href='https://youtu.be/aZzT538F92Y?t=34'>Back Tap Feature (MKBHD video)</a>. The final result: you can log a drink to the Consume app by simply tapping the back of your iPhone."
}